{
  "meta": {
    "title": "TNGT - The Next Generation of Taiwanese"
  },
  "nav": {
    "home": "Home",
    "about": "About",
    "team": "Team",
    "news": "News",
    "events": "Events",
    "partners": "Partners",
    "links": "Links",
    "join": "Join Us"
  },
  "common": {
    "language": "Language",
    "changeLanguage": "Change Language"
  },
  "home": {
    "title": "The Next Generation of Taiwanese - TNGT",
    "subtitle": "",
    "description1": "We aspire to develop into a genuine civic organization;",
    "description2": "to represent young people in participating in public affairs of all scales.",
    "description3": "We pursue democracy and freedom, firmly believing that the power of youth can drive social progress;",
    "description4": "We focus on democracy, education, and gender equality, uniting student voices to build a platform of our own.",
    "joinDiscord": "Join Discord",
    "discord_members": "Current community members: "
  },
  "about": {
    "title": "About Us",
    "introduction": {
      "title": "Organization Introduction",
      "motivation": "The motivation for establishing the community:",
      "content": "After sharing our experiences participating in civic movements on social media, we faced mockery like \"You're only eighteen, what do you know?\" and \"Read more books.\" We refuse to let age constrain our freedom of thought, nor are we satisfied with having our opinions dismissed by \"adults\" using their experience advantage. Seeing many young people similarly attacked maliciously, we determined to unite these students who care about the nation's future and build a platform for our voices."
    },
    "philosophy": {
      "title": "Our Philosophy",
      "content": "We pursue democracy and freedom, firmly believing that youth power can drive social progress."
    },
    "issues": {
      "title": "Focus Issues",
      "items": [
        "Opposing authoritarian dictatorship",
        "Defending democratic values",
        "Educational diversity and reform",
        "Promoting gender equality",
        "Traffic equity and pedestrian safety"
      ]
    },
    "goals": {
      "title": "Demands and Goals",
      "items": [
        {
          "title": "Opposing authoritarian dictatorship",
          "content": "Defending democracy, letting the people truly govern, rejecting any form of dictatorial rule."
        },
        {
          "title": "Anti-aggression",
          "content": "Opposing any country's irrational infringement on Taiwan's sovereignty, advocating for strengthening national security laws and anti-infiltration laws, as well as national defense awareness."
        },
        {
          "title": "Promoting democratic freedom and enhancing self-identity",
          "content": "Improving media literacy, supporting local cultural creators, and promoting the construction of autonomous and highly secure social platforms."
        },
        {
          "title": "Strengthening campus gender equality education",
          "content": "Deepening teachers' and students' understanding and respect for diverse genders and sexual orientations, building a friendly campus environment."
        },
        {
          "title": "Reforming the education system",
          "content": "Opposing academic credentialism, encouraging diverse development; strengthening private school supervision and teacher evaluation, and optimizing curriculum budget allocation."
        },
        {
          "title": "Defending traffic equity and ensuring pedestrian safety",
          "content": "Widely establishing sidewalks near schools, improving traffic signal design, and strengthening law enforcement to ensure pedestrian priority."
        }
      ]
    },
    "contact_us": "Contact Us"
  },
  "team": {
    "title": "Team",
    "total_members": "Total Members",
    "teams": {
      "executive_committee": "Executive Committee",
      "administrative_team": "Administrative Team",
      "financial_team": "Financial Team",
      "public_relations_team": "Public Relations Team",
      "creative_team": "Creative Team",
      "it_team": "IT Team",
      "advisory_team": "Advisory Team"
    },
    "member_count": {
      "current": "Currently our team has",
      "fallback": "over 30 ",
      "total": "staff members, some of whom choose not to be publicly displayed."
    }
  },
  "news": {
    "title": "News",
    "no_news": "No news",
    "categories": {
      "event_promotion": "Event Promotion",
      "website_update": "Website Update"
    }
  },
  "events": {
    "title": "Events",
    "event_photos": "Event Photos"
  },
  "partners": {
    "title": "Partners",
    "list": [
      {
        "img": "https://i.imgur.com/ebWDTs6.png",
        "name": "Fragile Items Chronicle",
        "paras": [
          "Raise international awareness of human rights conditions in China through multimedia content and advocacy, promoting a fairer and more just world.",
          "Fragile Items Chronicle, real name Leung Kai-chun, created satirical works about the Chinese government online; at 15 he was investigated by Hong Kong police and later fled Hong Kong to seek political asylum in the United States.",
          "While exiled in the United States, he continued anti-Communist activism and assisted other young people from Hong Kong in escaping and seeking political asylum, for example helping \"A-Long\" go to Canada.",
          "He is now enrolled in university and plans to continue raising international awareness of China's human rights situation through initiatives such as the Great Translation Movement."
        ],
        "link": "https://www.youtube.com/%40FragileItemsChronicle"
      }
    ],
    "link": {
      "1": "Learn more",
      "2": "'s information"
    }
  },
  "links": {
    "title": "Links",
    "description": "Welcome to the links overview page of \"The Next Generation of Taiwanese\" (TNGT). Through the following links, you can quickly learn about our latest developments, join community discussions, and follow our updates on various platforms.",
    "links_name": {
      "website": "Website",
      "discord": "Discord",
      "youtube": "Youtube",
      "threads": "Threads",
      "instagram": "Instagram",
      "email": "Email",
      "github": "GitHub"
    }
  },
  "join": {
    "title": "Join Us",
    "long_term_volunteers": "Recruiting long-term volunteers for all teams",
    "condition_title": "We are recruiting long-term volunteers for all teams and sincerely invite you to join us. Please review the following participation conditions:",
    "conditions": {
      "age": "You are a student below the university level and not older than 25 (those over 25 can only serve as advisors)",
      "commitment": "You can serve in a long-term position and guarantee ample time to participate in online or offline meetings",
      "agreement": "You agree with the philosophy of this organization and are willing to promote the voices of youth with us"
    },
    "bylaws": "Click me to view the bylaws",
    "agree_bylaws": "I meet the above conditions and agree to abide by the bylaws",
    "please_read_bylaws": "Please read and agree to all the above terms before proceeding with the application",
    "join_btn": "Apply to join"
  },
  "footer": {
    "copyright": "Copyright",
    "organization": "The Next Generation of Taiwanese",
    "license": "MIT License"
  }
}
